MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
// Register: TXB0SIDL
#define TXB0SIDL TXB0SIDL
extern volatile unsigned char           TXB0SIDL            __at(0xF42);
#ifndef _LIB_BUILD
asm("TXB0SIDL equ 0F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned TXB0EID16              :1;
        unsigned TXB0EID17              :1;
        unsigned                        :1;
        unsigned TXB0EXIDE              :1;
        unsigned                        :1;
        unsigned TXB0SID0               :1;
        unsigned TXB0SID1               :1;
        unsigned TXB0SID2               :1;
    };
} TXB0SIDLbits_t;
extern volatile TXB0SIDLbits_t TXB0SIDLbits __at(0xF42);
// bitfield macros
#define _TXB0SIDL_EID16_POSN                                0x0
#define _TXB0SIDL_EID16_POSITION                            0x0
#define _TXB0SIDL_EID16_SIZE                                0x1
#define _TXB0SIDL_EID16_LENGTH                              0x1
#define _TXB0SIDL_EID16_MASK                                0x1
#define _TXB0SIDL_EID17_POSN                                0x1
#define _TXB0SIDL_EID17_POSITION                            0x1
#define _TXB0SIDL_EID17_SIZE                                0x1
#define _TXB0SIDL_EID17_LENGTH                              0x1
#define _TXB0SIDL_EID17_MASK                                0x2
#define _TXB0SIDL_EXIDE_POSN                                0x3
#define _TXB0SIDL_EXIDE_POSITION                            0x3
#define _TXB0SIDL_EXIDE_SIZE                                0x1
#define _TXB0SIDL_EXIDE_LENGTH                              0x1
#define _TXB0SIDL_EXIDE_MASK                                0x8
#define _TXB0SIDL_SID0_POSN                                 0x5
#define _TXB0SIDL_SID0_POSITION                             0x5
#define _TXB0SIDL_SID0_SIZE                                 0x1
#define _TXB0SIDL_SID0_LENGTH                               0x1
#define _TXB0SIDL_SID0_MASK                                 0x20
#define _TXB0SIDL_SID1_POSN                                 0x6
#define _TXB0SIDL_SID1_POSITION                             0x6
#define _TXB0SIDL_SID1_SIZE                                 0x1
#define _TXB0SIDL_SID1_LENGTH                               0x1
#define _TXB0SIDL_SID1_MASK                                 0x40
#define _TXB0SIDL_SID2_POSN                                 0x7
#define _TXB0SIDL_SID2_POSITION                             0x7
#define _TXB0SIDL_SID2_SIZE                                 0x1
#define _TXB0SIDL_SID2_LENGTH                               0x1
#define _TXB0SIDL_SID2_MASK                                 0x80
#define _TXB0SIDL_TXB0EID16_POSN                            0x0
#define _TXB0SIDL_TXB0EID16_POSITION                        0x0
#define _TXB0SIDL_TXB0EID16_SIZE                            0x1
#define _TXB0SIDL_TXB0EID16_LENGTH                          0x1
#define _TXB0SIDL_TXB0EID16_MASK                            0x1
#define _TXB0SIDL_TXB0EID17_POSN                            0x1
#define _TXB0SIDL_TXB0EID17_POSITION                        0x1
#define _TXB0SIDL_TXB0EID17_SIZE                            0x1
#define _TXB0SIDL_TXB0EID17_LENGTH                          0x1
#define _TXB0SIDL_TXB0EID17_MASK                            0x2
#define _TXB0SIDL_TXB0EXIDE_POSN                            0x3
#define _TXB0SIDL_TXB0EXIDE_POSITION                        0x3
#define _TXB0SIDL_TXB0EXIDE_SIZE                            0x1
#define _TXB0SIDL_TXB0EXIDE_LENGTH                          0x1
#define _TXB0SIDL_TXB0EXIDE_MASK                            0x8
#define _TXB0SIDL_TXB0SID0_POSN                             0x5
#define _TXB0SIDL_TXB0SID0_POSITION                         0x5
#define _TXB0SIDL_TXB0SID0_SIZE                             0x1
#define _TXB0SIDL_TXB0SID0_LENGTH                           0x1
#define _TXB0SIDL_TXB0SID0_MASK                             0x20
#define _TXB0SIDL_TXB0SID1_POSN                             0x6
#define _TXB0SIDL_TXB0SID1_POSITION                         0x6
#define _TXB0SIDL_TXB0SID1_SIZE                             0x1
#define _TXB0SIDL_TXB0SID1_LENGTH                           0x1
#define _TXB0SIDL_TXB0SID1_MASK                             0x40
#define _TXB0SIDL_TXB0SID2_POSN                             0x7
#define _TXB0SIDL_TXB0SID2_POSITION                         0x7
#define _TXB0SIDL_TXB0SID2_SIZE                             0x1
#define _TXB0SIDL_TXB0SID2_LENGTH                           0x1
#define _TXB0SIDL_TXB0SID2_MASK                             0x80

// Register: TXB0EIDH
#define TXB0EIDH TXB0EIDH
extern volatile unsigned char           TXB0EIDH            __at(0xF43);
#ifndef _LIB_BUILD
asm("TXB0EIDH equ 0F43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned TXB0EID8               :1;
        unsigned TXB0EID9               :1;
        unsigned TXB0EID10              :1;
        unsigned TXB0EID11              :1;
        unsigned TXB0EID12              :1;
        unsigned TXB0EID13              :1;
        unsigned TXB0EID14              :1;
        unsigned TXB0EID15              :1;
    };
} TXB0EIDHbits_t;
extern volatile TXB0EIDHbits_t TXB0EIDHbits __at(0xF43);
// bitfield macros
#define _TXB0EIDH_EID8_POSN                                 0x0
#define _TXB0EIDH_EID8_POSITION                             0x0
#define _TXB0EIDH_EID8_SIZE                                 0x1
#define _TXB0EIDH_EID8_LENGTH                               0x1
#define _TXB0EIDH_EID8_MASK                                 0x1
#define _TXB0EIDH_EID9_POSN                                 0x1
#define _TXB0EIDH_EID9_POSITION                             0x1
#define _TXB0EIDH_EID9_SIZE                                 0x1
#define _TXB0EIDH_EID9_LENGTH                               0x1
#define _TXB0EIDH_EID9_MASK                                 0x2
#define _TXB0EIDH_EID10_POSN                                0x2
#define _TXB0EIDH_EID10_POSITION                            0x2
#define _TXB0EIDH_EID10_SIZE                                0x1
#define _TXB0EIDH_EID10_LENGTH                              0x1
#define _TXB0EIDH_EID10_MASK                                0x4
#define _TXB0EIDH_EID11_POSN                                0x3
#define _TXB0EIDH_EID11_POSITION                            0x3
#define _TXB0EIDH_EID11_SIZE                                0x1
#define _TXB0EIDH_EID11_LENGTH                              0x1
#define _TXB0EIDH_EID11_MASK                                0x8
#define _TXB0EIDH_EID12_POSN                                0x4
#define _TXB0EIDH_EID12_POSITION                            0x4
#define _TXB0EIDH_EID12_SIZE                                0x1
#define _TXB0EIDH_EID12_LENGTH                              0x1
#define _TXB0EIDH_EID12_MASK                                0x10
#define _TXB0EIDH_EID13_POSN                                0x5
#define _TXB0EIDH_EID13_POSITION                            0x5
#define _TXB0EIDH_EID13_SIZE                                0x1
#define _TXB0EIDH_EID13_LENGTH                              0x1
#define _TXB0EIDH_EID13_MASK                                0x20
#define _TXB0EIDH_EID14_POSN                                0x6
#define _TXB0EIDH_EID14_POSITION                            0x6
#define _TXB0EIDH_EID14_SIZE                                0x1
#define _TXB0EIDH_EID14_LENGTH                              0x1
#define _TXB0EIDH_EID14_MASK                                0x40
#define _TXB0EIDH_EID15_POSN                                0x7
#define _TXB0EIDH_EID15_POSITION                            0x7
#define _TXB0EIDH_EID15_SIZE                                0x1
#define _TXB0EIDH_EID15_LENGTH                              0x1
#define _TXB0EIDH_EID15_MASK                                0x80
#define _TXB0EIDH_TXB0EID8_POSN                             0x0
#define _TXB0EIDH_TXB0EID8_POSITION                         0x0
#define _TXB0EIDH_TXB0EID8_SIZE                             0x1
#define _TXB0EIDH_TXB0EID8_LENGTH                           0x1
#define _TXB0EIDH_TXB0EID8_MASK                             0x1
#define _TXB0EIDH_TXB0EID9_POSN                             0x1
#define _TXB0EIDH_TXB0EID9_POSITION                         0x1
#define _TXB0EIDH_TXB0EID9_SIZE                             0x1
#define _TXB0EIDH_TXB0EID9_LENGTH                           0x1
#define _TXB0EIDH_TXB0EID9_MASK                             0x2
#define _TXB0EIDH_TXB0EID10_POSN                            0x2
#define _TXB0EIDH_TXB0EID10_POSITION                        0x2
#define _TXB0EIDH_TXB0EID10_SIZE                            0x1
#define _TXB0EIDH_TXB0EID10_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID10_MASK                            0x4
#define _TXB0EIDH_TXB0EID11_POSN                            0x3
#define _TXB0EIDH_TXB0EID11_POSITION                        0x3
#define _TXB0EIDH_TXB0EID11_SIZE                            0x1
#define _TXB0EIDH_TXB0EID11_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID11_MASK                            0x8
#define _TXB0EIDH_TXB0EID12_POSN                            0x4
#define _TXB0EIDH_TXB0EID12_POSITION                        0x4
#define _TXB0EIDH_TXB0EID12_SIZE                            0x1
#define _TXB0EIDH_TXB0EID12_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID12_MASK                            0x10
#define _TXB0EIDH_TXB0EID13_POSN                            0x5
#define _TXB0EIDH_TXB0EID13_POSITION                        0x5
#define _TXB0EIDH_TXB0EID13_SIZE                            0x1
#define _TXB0EIDH_TXB0EID13_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID13_MASK                            0x20
#define _TXB0EIDH_TXB0EID14_POSN                            0x6
#define _TXB0EIDH_TXB0EID14_POSITION                        0x6
#define _TXB0EIDH_TXB0EID14_SIZE                            0x1
#define _TXB0EIDH_TXB0EID14_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID14_MASK                            0x40
#define _TXB0EIDH_TXB0EID15_POSN                            0x7
#define _TXB0EIDH_TXB0EID15_POSITION                        0x7
#define _TXB0EIDH_TXB0EID15_SIZE                            0x1
#define _TXB0EIDH_TXB0EID15_LENGTH                          0x1
#define _TXB0EIDH_TXB0EID15_MASK                            0x80

// Register: TXB0EIDL
#define TXB0EIDL TXB0EIDL
extern volatile unsigned char           TXB0EIDL            __at(0xF44);
#ifndef _LIB_BUILD
asm("TXB0EIDL equ 0F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned TXB0EID0               :1;
        unsigned TXB0EID1               :1;
        unsigned TXB0EID2               :1;
        unsigned TXB0EID3               :1;
        unsigned TXB0EID4               :1;
        unsigned TXB0EID5               :1;
        unsigned TXB0EID6               :1;
        unsigned TXB0EID7               :1;
    };
} TXB0EIDLbits_t;
extern volatile TXB0EIDLbits_t TXB0EIDLbits __at(0xF44);
// bitfield macros
#define _TXB0EIDL_EID0_POSN                                 0x0
#define _TXB0EIDL_EID0_POSITION                             0x0
#define _TXB0EIDL_EID0_SIZE                                 0x1
#define _TXB0EIDL_EID0_LENGTH                               0x1
#define _TXB0EIDL_EID0_MASK                                 0x1
#define _TXB0EIDL_EID1_POSN                                 0x1
#define _TXB0EIDL_EID1_POSITION                             0x1
#define _TXB0EIDL_EID1_SIZE                                 0x1
#define _TXB0EIDL_EID1_LENGTH                               0x1
#define _TXB0EIDL_EID1_MASK                                 0x2
#define _TXB0EIDL_EID2_POSN                                 0x2
#define _TXB0EIDL_EID2_POSITION                             0x2
#define _TXB0EIDL_EID2_SIZE                                 0x1
#define _TXB0EIDL_EID2_LENGTH                               0x1
#define _TXB0EIDL_EID2_MASK                                 0x4
#define _TXB0EIDL_EID3_POSN                                 0x3
#define _TXB0EIDL_EID3_POSITION                             0x3
#define _TXB0EIDL_EID3_SIZE                                 0x1
#define _TXB0EIDL_EID3_LENGTH                               0x1
#define _TXB0EIDL_EID3_MASK                                 0x8
#define _TXB0EIDL_EID4_POSN                                 0x4
#define _TXB0EIDL_EID4_POSITION                             0x4
#define _TXB0EIDL_EID4_SIZE                                 0x1
#define _TXB0EIDL_EID4_LENGTH                               0x1
#define _TXB0EIDL_EID4_MASK                                 0x10
#define _TXB0EIDL_EID5_POSN                                 0x5
#define _TXB0EIDL_EID5_POSITION                             0x5
#define _TXB0EIDL_EID5_SIZE                                 0x1
#define _TXB0EIDL_EID5_LENGTH                               0x1
#define _TXB0EIDL_EID5_MASK                                 0x20
#define _TXB0EIDL_EID6_POSN                                 0x6
#define _TXB0EIDL_EID6_POSITION                             0x6
#define _TXB0EIDL_EID6_SIZE                                 0x1
#define _TXB0EIDL_EID6_LENGTH                               0x1
#define _TXB0EIDL_EID6_MASK                                 0x40
#define _TXB0EIDL_EID7_POSN                                 0x7
#define _TXB0EIDL_EID7_POSITION                             0x7
#define _TXB0EIDL_EID7_SIZE                                 0x1
#define _TXB0EIDL_EID7_LENGTH                               0x1
#define _TXB0EIDL_EID7_MASK                                 0x80
#define _TXB0EIDL_TXB0EID0_POSN                             0x0
#define _TXB0EIDL_TXB0EID0_POSITION                         0x0
#define _TXB0EIDL_TXB0EID0_SIZE                             0x1
#define _TXB0EIDL_TXB0EID0_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID0_MASK                             0x1
#define _TXB0EIDL_TXB0EID1_POSN                             0x1
#define _TXB0EIDL_TXB0EID1_POSITION                         0x1
#define _TXB0EIDL_TXB0EID1_SIZE                             0x1
#define _TXB0EIDL_TXB0EID1_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID1_MASK                             0x2
#define _TXB0EIDL_TXB0EID2_POSN                             0x2
#define _TXB0EIDL_TXB0EID2_POSITION                         0x2
#define _TXB0EIDL_TXB0EID2_SIZE                             0x1
#define _TXB0EIDL_TXB0EID2_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID2_MASK                             0x4
#define _TXB0EIDL_TXB0EID3_POSN                             0x3
#define _TXB0EIDL_TXB0EID3_POSITION                         0x3
#define _TXB0EIDL_TXB0EID3_SIZE                             0x1
#define _TXB0EIDL_TXB0EID3_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID3_MASK                             0x8
#define _TXB0EIDL_TXB0EID4_POSN                             0x4
#define _TXB0EIDL_TXB0EID4_POSITION                         0x4
#define _TXB0EIDL_TXB0EID4_SIZE                             0x1
#define _TXB0EIDL_TXB0EID4_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID4_MASK                             0x10
#define _TXB0EIDL_TXB0EID5_POSN                             0x5
#define _TXB0EIDL_TXB0EID5_POSITION                         0x5
#define _TXB0EIDL_TXB0EID5_SIZE                             0x1
#define _TXB0EIDL_TXB0EID5_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID5_MASK                             0x20
#define _TXB0EIDL_TXB0EID6_POSN                             0x6
#define _TXB0EIDL_TXB0EID6_POSITION                         0x6
#define _TXB0EIDL_TXB0EID6_SIZE                             0x1
#define _TXB0EIDL_TXB0EID6_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID6_MASK                             0x40
#define _TXB0EIDL_TXB0EID7_POSN                             0x7
#define _TXB0EIDL_TXB0EID7_POSITION                         0x7
#define _TXB0EIDL_TXB0EID7_SIZE                             0x1
#define _TXB0EIDL_TXB0EID7_LENGTH                           0x1
#define _TXB0EIDL_TXB0EID7_MASK                             0x80

// Register: TXB0DLC
#define TXB0DLC TXB0DLC
extern volatile unsigned char           TXB0DLC             __at(0xF45);
#ifndef _LIB_BUILD
asm("TXB0DLC equ 0F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned                        :2;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned TXB0DLC0               :1;
        unsigned TXB0DLC1               :1;
        unsigned TXB0DLC2               :1;
        unsigned TXB0DLC3               :1;
        unsigned                        :2;
        unsigned TXB0RTR                :1;
    };
} TXB0DLCbits_t;
