MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
// Register: RXB0EIDL
#define RXB0EIDL RXB0EIDL
extern volatile unsigned char           RXB0EIDL            __at(0xF64);
#ifndef _LIB_BUILD
asm("RXB0EIDL equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXB0EID0               :1;
        unsigned RXB0EID1               :1;
        unsigned RXB0EID2               :1;
        unsigned RXB0EID3               :1;
        unsigned RXB0EID4               :1;
        unsigned RXB0EID5               :1;
        unsigned RXB0EID6               :1;
        unsigned RXB0EID7               :1;
    };
} RXB0EIDLbits_t;
extern volatile RXB0EIDLbits_t RXB0EIDLbits __at(0xF64);
// bitfield macros
#define _RXB0EIDL_EID0_POSN                                 0x0
#define _RXB0EIDL_EID0_POSITION                             0x0
#define _RXB0EIDL_EID0_SIZE                                 0x1
#define _RXB0EIDL_EID0_LENGTH                               0x1
#define _RXB0EIDL_EID0_MASK                                 0x1
#define _RXB0EIDL_EID1_POSN                                 0x1
#define _RXB0EIDL_EID1_POSITION                             0x1
#define _RXB0EIDL_EID1_SIZE                                 0x1
#define _RXB0EIDL_EID1_LENGTH                               0x1
#define _RXB0EIDL_EID1_MASK                                 0x2
#define _RXB0EIDL_EID2_POSN                                 0x2
#define _RXB0EIDL_EID2_POSITION                             0x2
#define _RXB0EIDL_EID2_SIZE                                 0x1
#define _RXB0EIDL_EID2_LENGTH                               0x1
#define _RXB0EIDL_EID2_MASK                                 0x4
#define _RXB0EIDL_EID3_POSN                                 0x3
#define _RXB0EIDL_EID3_POSITION                             0x3
#define _RXB0EIDL_EID3_SIZE                                 0x1
#define _RXB0EIDL_EID3_LENGTH                               0x1
#define _RXB0EIDL_EID3_MASK                                 0x8
#define _RXB0EIDL_EID4_POSN                                 0x4
#define _RXB0EIDL_EID4_POSITION                             0x4
#define _RXB0EIDL_EID4_SIZE                                 0x1
#define _RXB0EIDL_EID4_LENGTH                               0x1
#define _RXB0EIDL_EID4_MASK                                 0x10
#define _RXB0EIDL_EID5_POSN                                 0x5
#define _RXB0EIDL_EID5_POSITION                             0x5
#define _RXB0EIDL_EID5_SIZE                                 0x1
#define _RXB0EIDL_EID5_LENGTH                               0x1
#define _RXB0EIDL_EID5_MASK                                 0x20
#define _RXB0EIDL_EID6_POSN                                 0x6
#define _RXB0EIDL_EID6_POSITION                             0x6
#define _RXB0EIDL_EID6_SIZE                                 0x1
#define _RXB0EIDL_EID6_LENGTH                               0x1
#define _RXB0EIDL_EID6_MASK                                 0x40
#define _RXB0EIDL_EID7_POSN                                 0x7
#define _RXB0EIDL_EID7_POSITION                             0x7
#define _RXB0EIDL_EID7_SIZE                                 0x1
#define _RXB0EIDL_EID7_LENGTH                               0x1
#define _RXB0EIDL_EID7_MASK                                 0x80
#define _RXB0EIDL_RXB0EID0_POSN                             0x0
#define _RXB0EIDL_RXB0EID0_POSITION                         0x0
#define _RXB0EIDL_RXB0EID0_SIZE                             0x1
#define _RXB0EIDL_RXB0EID0_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID0_MASK                             0x1
#define _RXB0EIDL_RXB0EID1_POSN                             0x1
#define _RXB0EIDL_RXB0EID1_POSITION                         0x1
#define _RXB0EIDL_RXB0EID1_SIZE                             0x1
#define _RXB0EIDL_RXB0EID1_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID1_MASK                             0x2
#define _RXB0EIDL_RXB0EID2_POSN                             0x2
#define _RXB0EIDL_RXB0EID2_POSITION                         0x2
#define _RXB0EIDL_RXB0EID2_SIZE                             0x1
#define _RXB0EIDL_RXB0EID2_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID2_MASK                             0x4
#define _RXB0EIDL_RXB0EID3_POSN                             0x3
#define _RXB0EIDL_RXB0EID3_POSITION                         0x3
#define _RXB0EIDL_RXB0EID3_SIZE                             0x1
#define _RXB0EIDL_RXB0EID3_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID3_MASK                             0x8
#define _RXB0EIDL_RXB0EID4_POSN                             0x4
#define _RXB0EIDL_RXB0EID4_POSITION                         0x4
#define _RXB0EIDL_RXB0EID4_SIZE                             0x1
#define _RXB0EIDL_RXB0EID4_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID4_MASK                             0x10
#define _RXB0EIDL_RXB0EID5_POSN                             0x5
#define _RXB0EIDL_RXB0EID5_POSITION                         0x5
#define _RXB0EIDL_RXB0EID5_SIZE                             0x1
#define _RXB0EIDL_RXB0EID5_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID5_MASK                             0x20
#define _RXB0EIDL_RXB0EID6_POSN                             0x6
#define _RXB0EIDL_RXB0EID6_POSITION                         0x6
#define _RXB0EIDL_RXB0EID6_SIZE                             0x1
#define _RXB0EIDL_RXB0EID6_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID6_MASK                             0x40
#define _RXB0EIDL_RXB0EID7_POSN                             0x7
#define _RXB0EIDL_RXB0EID7_POSITION                         0x7
#define _RXB0EIDL_RXB0EID7_SIZE                             0x1
#define _RXB0EIDL_RXB0EID7_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID7_MASK                             0x80

// Register: RXB0DLC
#define RXB0DLC RXB0DLC
extern volatile unsigned char           RXB0DLC             __at(0xF65);
#ifndef _LIB_BUILD
asm("RXB0DLC equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESB0                  :1;
        unsigned RESB1                  :1;
    };
    struct {
        unsigned RXB0DLC0               :1;
        unsigned RXB0DLC1               :1;
        unsigned RXB0DLC2               :1;
        unsigned RXB0DLC3               :1;
        unsigned RXB0RB0                :1;
        unsigned RXB0RB1                :1;
        unsigned RXB0RTR                :1;
    };
} RXB0DLCbits_t;
extern volatile RXB0DLCbits_t RXB0DLCbits __at(0xF65);
// bitfield macros
#define _RXB0DLC_DLC0_POSN                                  0x0
#define _RXB0DLC_DLC0_POSITION                              0x0
#define _RXB0DLC_DLC0_SIZE                                  0x1
#define _RXB0DLC_DLC0_LENGTH                                0x1
#define _RXB0DLC_DLC0_MASK                                  0x1
#define _RXB0DLC_DLC1_POSN                                  0x1
#define _RXB0DLC_DLC1_POSITION                              0x1
#define _RXB0DLC_DLC1_SIZE                                  0x1
#define _RXB0DLC_DLC1_LENGTH                                0x1
#define _RXB0DLC_DLC1_MASK                                  0x2
#define _RXB0DLC_DLC2_POSN                                  0x2
#define _RXB0DLC_DLC2_POSITION                              0x2
#define _RXB0DLC_DLC2_SIZE                                  0x1
#define _RXB0DLC_DLC2_LENGTH                                0x1
#define _RXB0DLC_DLC2_MASK                                  0x4
#define _RXB0DLC_DLC3_POSN                                  0x3
#define _RXB0DLC_DLC3_POSITION                              0x3
#define _RXB0DLC_DLC3_SIZE                                  0x1
#define _RXB0DLC_DLC3_LENGTH                                0x1
#define _RXB0DLC_DLC3_MASK                                  0x8
#define _RXB0DLC_RB0_POSN                                   0x4
#define _RXB0DLC_RB0_POSITION                               0x4
#define _RXB0DLC_RB0_SIZE                                   0x1
#define _RXB0DLC_RB0_LENGTH                                 0x1
#define _RXB0DLC_RB0_MASK                                   0x10
#define _RXB0DLC_RB1_POSN                                   0x5
#define _RXB0DLC_RB1_POSITION                               0x5
#define _RXB0DLC_RB1_SIZE                                   0x1
#define _RXB0DLC_RB1_LENGTH                                 0x1
#define _RXB0DLC_RB1_MASK                                   0x20
#define _RXB0DLC_RXRTR_POSN                                 0x6
#define _RXB0DLC_RXRTR_POSITION                             0x6
#define _RXB0DLC_RXRTR_SIZE                                 0x1
#define _RXB0DLC_RXRTR_LENGTH                               0x1
#define _RXB0DLC_RXRTR_MASK                                 0x40
#define _RXB0DLC_RESB0_POSN                                 0x4
#define _RXB0DLC_RESB0_POSITION                             0x4
#define _RXB0DLC_RESB0_SIZE                                 0x1
#define _RXB0DLC_RESB0_LENGTH                               0x1
#define _RXB0DLC_RESB0_MASK                                 0x10
#define _RXB0DLC_RESB1_POSN                                 0x5
#define _RXB0DLC_RESB1_POSITION                             0x5
#define _RXB0DLC_RESB1_SIZE                                 0x1
#define _RXB0DLC_RESB1_LENGTH                               0x1
#define _RXB0DLC_RESB1_MASK                                 0x20
#define _RXB0DLC_RXB0DLC0_POSN                              0x0
#define _RXB0DLC_RXB0DLC0_POSITION                          0x0
#define _RXB0DLC_RXB0DLC0_SIZE                              0x1
#define _RXB0DLC_RXB0DLC0_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC0_MASK                              0x1
#define _RXB0DLC_RXB0DLC1_POSN                              0x1
#define _RXB0DLC_RXB0DLC1_POSITION                          0x1
#define _RXB0DLC_RXB0DLC1_SIZE                              0x1
#define _RXB0DLC_RXB0DLC1_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC1_MASK                              0x2
#define _RXB0DLC_RXB0DLC2_POSN                              0x2
#define _RXB0DLC_RXB0DLC2_POSITION                          0x2
#define _RXB0DLC_RXB0DLC2_SIZE                              0x1
#define _RXB0DLC_RXB0DLC2_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC2_MASK                              0x4
#define _RXB0DLC_RXB0DLC3_POSN                              0x3
#define _RXB0DLC_RXB0DLC3_POSITION                          0x3
#define _RXB0DLC_RXB0DLC3_SIZE                              0x1
#define _RXB0DLC_RXB0DLC3_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC3_MASK                              0x8
#define _RXB0DLC_RXB0RB0_POSN                               0x4
#define _RXB0DLC_RXB0RB0_POSITION                           0x4
#define _RXB0DLC_RXB0RB0_SIZE                               0x1
#define _RXB0DLC_RXB0RB0_LENGTH                             0x1
#define _RXB0DLC_RXB0RB0_MASK                               0x10
#define _RXB0DLC_RXB0RB1_POSN                               0x5
#define _RXB0DLC_RXB0RB1_POSITION                           0x5
#define _RXB0DLC_RXB0RB1_SIZE                               0x1
#define _RXB0DLC_RXB0RB1_LENGTH                             0x1
#define _RXB0DLC_RXB0RB1_MASK                               0x20
#define _RXB0DLC_RXB0RTR_POSN                               0x6
#define _RXB0DLC_RXB0RTR_POSITION                           0x6
#define _RXB0DLC_RXB0RTR_SIZE                               0x1
#define _RXB0DLC_RXB0RTR_LENGTH                             0x1
#define _RXB0DLC_RXB0RTR_MASK                               0x40

// Register: RXB0D0
#define RXB0D0 RXB0D0
extern volatile unsigned char           RXB0D0              __at(0xF66);
#ifndef _LIB_BUILD
asm("RXB0D0 equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D00                :1;
        unsigned RXB0D01                :1;
        unsigned RXB0D02                :1;
        unsigned RXB0D03                :1;
        unsigned RXB0D04                :1;
        unsigned RXB0D05                :1;
        unsigned RXB0D06                :1;
        unsigned RXB0D07                :1;
    };
    struct {
        unsigned RB0D00                 :1;
        unsigned RB0D01                 :1;
        unsigned RB0D02                 :1;
        unsigned RB0D03                 :1;
        unsigned RB0D04                 :1;
        unsigned RB0D05                 :1;
        unsigned RB0D06                 :1;
        unsigned RB0D07                 :1;
    };
} RXB0D0bits_t;
extern volatile RXB0D0bits_t RXB0D0bits __at(0xF66);
// bitfield macros
#define _RXB0D0_RXB0D00_POSN                                0x0
#define _RXB0D0_RXB0D00_POSITION                            0x0
#define _RXB0D0_RXB0D00_SIZE                                0x1
#define _RXB0D0_RXB0D00_LENGTH                              0x1
#define _RXB0D0_RXB0D00_MASK                                0x1
#define _RXB0D0_RXB0D01_POSN                                0x1
#define _RXB0D0_RXB0D01_POSITION                            0x1
#define _RXB0D0_RXB0D01_SIZE                                0x1
#define _RXB0D0_RXB0D01_LENGTH                              0x1
#define _RXB0D0_RXB0D01_MASK                                0x2
#define _RXB0D0_RXB0D02_POSN                                0x2
#define _RXB0D0_RXB0D02_POSITION                            0x2
#define _RXB0D0_RXB0D02_SIZE                                0x1
#define _RXB0D0_RXB0D02_LENGTH                              0x1
#define _RXB0D0_RXB0D02_MASK                                0x4
#define _RXB0D0_RXB0D03_POSN                                0x3
#define _RXB0D0_RXB0D03_POSITION                            0x3
#define _RXB0D0_RXB0D03_SIZE                                0x1
#define _RXB0D0_RXB0D03_LENGTH                              0x1
#define _RXB0D0_RXB0D03_MASK                                0x8
#define _RXB0D0_RXB0D04_POSN                                0x4
#define _RXB0D0_RXB0D04_POSITION                            0x4
#define _RXB0D0_RXB0D04_SIZE                                0x1
#define _RXB0D0_RXB0D04_LENGTH                              0x1
#define _RXB0D0_RXB0D04_MASK                                0x10
#define _RXB0D0_RXB0D05_POSN                                0x5
#define _RXB0D0_RXB0D05_POSITION                            0x5
#define _RXB0D0_RXB0D05_SIZE                                0x1
#define _RXB0D0_RXB0D05_LENGTH                              0x1
#define _RXB0D0_RXB0D05_MASK                                0x20
#define _RXB0D0_RXB0D06_POSN                                0x6
#define _RXB0D0_RXB0D06_POSITION                            0x6
#define _RXB0D0_RXB0D06_SIZE                                0x1
#define _RXB0D0_RXB0D06_LENGTH                              0x1
#define _RXB0D0_RXB0D06_MASK                                0x40
#define _RXB0D0_RXB0D07_POSN                                0x7
#define _RXB0D0_RXB0D07_POSITION                            0x7
#define _RXB0D0_RXB0D07_SIZE                                0x1
#define _RXB0D0_RXB0D07_LENGTH                              0x1
#define _RXB0D0_RXB0D07_MASK                                0x80
#define _RXB0D0_RB0D00_POSN                                 0x0
#define _RXB0D0_RB0D00_POSITION                             0x0
#define _RXB0D0_RB0D00_SIZE                                 0x1
#define _RXB0D0_RB0D00_LENGTH                               0x1
#define _RXB0D0_RB0D00_MASK                                 0x1
#define _RXB0D0_RB0D01_POSN                                 0x1
#define _RXB0D0_RB0D01_POSITION                             0x1
#define _RXB0D0_RB0D01_SIZE                                 0x1
#define _RXB0D0_RB0D01_LENGTH                               0x1
#define _RXB0D0_RB0D01_MASK                                 0x2
#define _RXB0D0_RB0D02_POSN                                 0x2
#define _RXB0D0_RB0D02_POSITION                             0x2
#define _RXB0D0_RB0D02_SIZE                                 0x1
#define _RXB0D0_RB0D02_LENGTH                               0x1
#define _RXB0D0_RB0D02_MASK                                 0x4
#define _RXB0D0_RB0D03_POSN                                 0x3
#define _RXB0D0_RB0D03_POSITION                             0x3
#define _RXB0D0_RB0D03_SIZE                                 0x1
#define _RXB0D0_RB0D03_LENGTH                               0x1
#define _RXB0D0_RB0D03_MASK                                 0x8
#define _RXB0D0_RB0D04_POSN                                 0x4
#define _RXB0D0_RB0D04_POSITION                             0x4
#define _RXB0D0_RB0D04_SIZE                                 0x1
#define _RXB0D0_RB0D04_LENGTH                               0x1
#define _RXB0D0_RB0D04_MASK                                 0x10
#define _RXB0D0_RB0D05_POSN                                 0x5
#define _RXB0D0_RB0D05_POSITION                             0x5
#define _RXB0D0_RB0D05_SIZE                                 0x1
#define _RXB0D0_RB0D05_LENGTH                               0x1
#define _RXB0D0_RB0D05_MASK                                 0x20
#define _RXB0D0_RB0D06_POSN                                 0x6
#define _RXB0D0_RB0D06_POSITION                             0x6
#define _RXB0D0_RB0D06_SIZE                                 0x1
#define _RXB0D0_RB0D06_LENGTH                               0x1
#define _RXB0D0_RB0D06_MASK                                 0x40
#define _RXB0D0_RB0D07_POSN                                 0x7
#define _RXB0D0_RB0D07_POSITION                             0x7
#define _RXB0D0_RB0D07_SIZE                                 0x1
#define _RXB0D0_RB0D07_LENGTH                               0x1
#define _RXB0D0_RB0D07_MASK                                 0x80

// Register: RXB0D1
#define RXB0D1 RXB0D1
extern volatile unsigned char           RXB0D1              __at(0xF67);
#ifndef _LIB_BUILD
asm("RXB0D1 equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D10                :1;
        unsigned RXB0D11                :1;
        unsigned RXB0D12                :1;
        unsigned RXB0D13                :1;
        unsigned RXB0D14                :1;
        unsigned RXB0D15                :1;
        unsigned RXB0D16                :1;
        unsigned RXB0D17                :1;
    };
    struct {
        unsigned RB0D10                 :1;
        unsigned RB0D11                 :1;
        unsigned RB0D12                 :1;
        unsigned RB0D13                 :1;
        unsigned RB0D14                 :1;
        unsigned RB0D15                 :1;
        unsigned RB0D16                 :1;
        unsigned RB0D17                 :1;
    };
} RXB0D1bits_t;
