MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
extern volatile RXB0D1bits_t RXB0D1bits __at(0xF67);
// bitfield macros
#define _RXB0D1_RXB0D10_POSN                                0x0
#define _RXB0D1_RXB0D10_POSITION                            0x0
#define _RXB0D1_RXB0D10_SIZE                                0x1
#define _RXB0D1_RXB0D10_LENGTH                              0x1
#define _RXB0D1_RXB0D10_MASK                                0x1
#define _RXB0D1_RXB0D11_POSN                                0x1
#define _RXB0D1_RXB0D11_POSITION                            0x1
#define _RXB0D1_RXB0D11_SIZE                                0x1
#define _RXB0D1_RXB0D11_LENGTH                              0x1
#define _RXB0D1_RXB0D11_MASK                                0x2
#define _RXB0D1_RXB0D12_POSN                                0x2
#define _RXB0D1_RXB0D12_POSITION                            0x2
#define _RXB0D1_RXB0D12_SIZE                                0x1
#define _RXB0D1_RXB0D12_LENGTH                              0x1
#define _RXB0D1_RXB0D12_MASK                                0x4
#define _RXB0D1_RXB0D13_POSN                                0x3
#define _RXB0D1_RXB0D13_POSITION                            0x3
#define _RXB0D1_RXB0D13_SIZE                                0x1
#define _RXB0D1_RXB0D13_LENGTH                              0x1
#define _RXB0D1_RXB0D13_MASK                                0x8
#define _RXB0D1_RXB0D14_POSN                                0x4
#define _RXB0D1_RXB0D14_POSITION                            0x4
#define _RXB0D1_RXB0D14_SIZE                                0x1
#define _RXB0D1_RXB0D14_LENGTH                              0x1
#define _RXB0D1_RXB0D14_MASK                                0x10
#define _RXB0D1_RXB0D15_POSN                                0x5
#define _RXB0D1_RXB0D15_POSITION                            0x5
#define _RXB0D1_RXB0D15_SIZE                                0x1
#define _RXB0D1_RXB0D15_LENGTH                              0x1
#define _RXB0D1_RXB0D15_MASK                                0x20
#define _RXB0D1_RXB0D16_POSN                                0x6
#define _RXB0D1_RXB0D16_POSITION                            0x6
#define _RXB0D1_RXB0D16_SIZE                                0x1
#define _RXB0D1_RXB0D16_LENGTH                              0x1
#define _RXB0D1_RXB0D16_MASK                                0x40
#define _RXB0D1_RXB0D17_POSN                                0x7
#define _RXB0D1_RXB0D17_POSITION                            0x7
#define _RXB0D1_RXB0D17_SIZE                                0x1
#define _RXB0D1_RXB0D17_LENGTH                              0x1
#define _RXB0D1_RXB0D17_MASK                                0x80
#define _RXB0D1_RB0D10_POSN                                 0x0
#define _RXB0D1_RB0D10_POSITION                             0x0
#define _RXB0D1_RB0D10_SIZE                                 0x1
#define _RXB0D1_RB0D10_LENGTH                               0x1
#define _RXB0D1_RB0D10_MASK                                 0x1
#define _RXB0D1_RB0D11_POSN                                 0x1
#define _RXB0D1_RB0D11_POSITION                             0x1
#define _RXB0D1_RB0D11_SIZE                                 0x1
#define _RXB0D1_RB0D11_LENGTH                               0x1
#define _RXB0D1_RB0D11_MASK                                 0x2
#define _RXB0D1_RB0D12_POSN                                 0x2
#define _RXB0D1_RB0D12_POSITION                             0x2
#define _RXB0D1_RB0D12_SIZE                                 0x1
#define _RXB0D1_RB0D12_LENGTH                               0x1
#define _RXB0D1_RB0D12_MASK                                 0x4
#define _RXB0D1_RB0D13_POSN                                 0x3
#define _RXB0D1_RB0D13_POSITION                             0x3
#define _RXB0D1_RB0D13_SIZE                                 0x1
#define _RXB0D1_RB0D13_LENGTH                               0x1
#define _RXB0D1_RB0D13_MASK                                 0x8
#define _RXB0D1_RB0D14_POSN                                 0x4
#define _RXB0D1_RB0D14_POSITION                             0x4
#define _RXB0D1_RB0D14_SIZE                                 0x1
#define _RXB0D1_RB0D14_LENGTH                               0x1
#define _RXB0D1_RB0D14_MASK                                 0x10
#define _RXB0D1_RB0D15_POSN                                 0x5
#define _RXB0D1_RB0D15_POSITION                             0x5
#define _RXB0D1_RB0D15_SIZE                                 0x1
#define _RXB0D1_RB0D15_LENGTH                               0x1
#define _RXB0D1_RB0D15_MASK                                 0x20
#define _RXB0D1_RB0D16_POSN                                 0x6
#define _RXB0D1_RB0D16_POSITION                             0x6
#define _RXB0D1_RB0D16_SIZE                                 0x1
#define _RXB0D1_RB0D16_LENGTH                               0x1
#define _RXB0D1_RB0D16_MASK                                 0x40
#define _RXB0D1_RB0D17_POSN                                 0x7
#define _RXB0D1_RB0D17_POSITION                             0x7
#define _RXB0D1_RB0D17_SIZE                                 0x1
#define _RXB0D1_RB0D17_LENGTH                               0x1
#define _RXB0D1_RB0D17_MASK                                 0x80

// Register: RXB0D2
#define RXB0D2 RXB0D2
extern volatile unsigned char           RXB0D2              __at(0xF68);
#ifndef _LIB_BUILD
asm("RXB0D2 equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D20                :1;
        unsigned RXB0D21                :1;
        unsigned RXB0D22                :1;
        unsigned RXB0D23                :1;
        unsigned RXB0D24                :1;
        unsigned RXB0D25                :1;
        unsigned RXB0D26                :1;
        unsigned RXB0D27                :1;
    };
    struct {
        unsigned RB0D20                 :1;
        unsigned RB0D21                 :1;
        unsigned RB0D22                 :1;
        unsigned RB0D23                 :1;
        unsigned RB0D24                 :1;
        unsigned RB0D25                 :1;
        unsigned RB0D26                 :1;
        unsigned RB0D27                 :1;
    };
} RXB0D2bits_t;
extern volatile RXB0D2bits_t RXB0D2bits __at(0xF68);
// bitfield macros
#define _RXB0D2_RXB0D20_POSN                                0x0
#define _RXB0D2_RXB0D20_POSITION                            0x0
#define _RXB0D2_RXB0D20_SIZE                                0x1
#define _RXB0D2_RXB0D20_LENGTH                              0x1
#define _RXB0D2_RXB0D20_MASK                                0x1
#define _RXB0D2_RXB0D21_POSN                                0x1
#define _RXB0D2_RXB0D21_POSITION                            0x1
#define _RXB0D2_RXB0D21_SIZE                                0x1
#define _RXB0D2_RXB0D21_LENGTH                              0x1
#define _RXB0D2_RXB0D21_MASK                                0x2
#define _RXB0D2_RXB0D22_POSN                                0x2
#define _RXB0D2_RXB0D22_POSITION                            0x2
#define _RXB0D2_RXB0D22_SIZE                                0x1
#define _RXB0D2_RXB0D22_LENGTH                              0x1
#define _RXB0D2_RXB0D22_MASK                                0x4
#define _RXB0D2_RXB0D23_POSN                                0x3
#define _RXB0D2_RXB0D23_POSITION                            0x3
#define _RXB0D2_RXB0D23_SIZE                                0x1
#define _RXB0D2_RXB0D23_LENGTH                              0x1
#define _RXB0D2_RXB0D23_MASK                                0x8
#define _RXB0D2_RXB0D24_POSN                                0x4
#define _RXB0D2_RXB0D24_POSITION                            0x4
#define _RXB0D2_RXB0D24_SIZE                                0x1
#define _RXB0D2_RXB0D24_LENGTH                              0x1
#define _RXB0D2_RXB0D24_MASK                                0x10
#define _RXB0D2_RXB0D25_POSN                                0x5
#define _RXB0D2_RXB0D25_POSITION                            0x5
#define _RXB0D2_RXB0D25_SIZE                                0x1
#define _RXB0D2_RXB0D25_LENGTH                              0x1
#define _RXB0D2_RXB0D25_MASK                                0x20
#define _RXB0D2_RXB0D26_POSN                                0x6
#define _RXB0D2_RXB0D26_POSITION                            0x6
#define _RXB0D2_RXB0D26_SIZE                                0x1
#define _RXB0D2_RXB0D26_LENGTH                              0x1
#define _RXB0D2_RXB0D26_MASK                                0x40
#define _RXB0D2_RXB0D27_POSN                                0x7
#define _RXB0D2_RXB0D27_POSITION                            0x7
#define _RXB0D2_RXB0D27_SIZE                                0x1
#define _RXB0D2_RXB0D27_LENGTH                              0x1
#define _RXB0D2_RXB0D27_MASK                                0x80
#define _RXB0D2_RB0D20_POSN                                 0x0
#define _RXB0D2_RB0D20_POSITION                             0x0
#define _RXB0D2_RB0D20_SIZE                                 0x1
#define _RXB0D2_RB0D20_LENGTH                               0x1
#define _RXB0D2_RB0D20_MASK                                 0x1
#define _RXB0D2_RB0D21_POSN                                 0x1
#define _RXB0D2_RB0D21_POSITION                             0x1
#define _RXB0D2_RB0D21_SIZE                                 0x1
#define _RXB0D2_RB0D21_LENGTH                               0x1
#define _RXB0D2_RB0D21_MASK                                 0x2
#define _RXB0D2_RB0D22_POSN                                 0x2
#define _RXB0D2_RB0D22_POSITION                             0x2
#define _RXB0D2_RB0D22_SIZE                                 0x1
#define _RXB0D2_RB0D22_LENGTH                               0x1
#define _RXB0D2_RB0D22_MASK                                 0x4
#define _RXB0D2_RB0D23_POSN                                 0x3
#define _RXB0D2_RB0D23_POSITION                             0x3
#define _RXB0D2_RB0D23_SIZE                                 0x1
#define _RXB0D2_RB0D23_LENGTH                               0x1
#define _RXB0D2_RB0D23_MASK                                 0x8
#define _RXB0D2_RB0D24_POSN                                 0x4
#define _RXB0D2_RB0D24_POSITION                             0x4
#define _RXB0D2_RB0D24_SIZE                                 0x1
#define _RXB0D2_RB0D24_LENGTH                               0x1
#define _RXB0D2_RB0D24_MASK                                 0x10
#define _RXB0D2_RB0D25_POSN                                 0x5
#define _RXB0D2_RB0D25_POSITION                             0x5
#define _RXB0D2_RB0D25_SIZE                                 0x1
#define _RXB0D2_RB0D25_LENGTH                               0x1
#define _RXB0D2_RB0D25_MASK                                 0x20
#define _RXB0D2_RB0D26_POSN                                 0x6
#define _RXB0D2_RB0D26_POSITION                             0x6
#define _RXB0D2_RB0D26_SIZE                                 0x1
#define _RXB0D2_RB0D26_LENGTH                               0x1
#define _RXB0D2_RB0D26_MASK                                 0x40
#define _RXB0D2_RB0D27_POSN                                 0x7
#define _RXB0D2_RB0D27_POSITION                             0x7
#define _RXB0D2_RB0D27_SIZE                                 0x1
#define _RXB0D2_RB0D27_LENGTH                               0x1
#define _RXB0D2_RB0D27_MASK                                 0x80

// Register: RXB0D3
#define RXB0D3 RXB0D3
extern volatile unsigned char           RXB0D3              __at(0xF69);
#ifndef _LIB_BUILD
asm("RXB0D3 equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D30                :1;
        unsigned RXB0D31                :1;
        unsigned RXB0D32                :1;
        unsigned RXB0D33                :1;
        unsigned RXB0D34                :1;
        unsigned RXB0D35                :1;
        unsigned RXB0D36                :1;
        unsigned RXB0D37                :1;
    };
    struct {
        unsigned RB0D30                 :1;
        unsigned RB0D31                 :1;
        unsigned RB0D32                 :1;
        unsigned RB0D33                 :1;
        unsigned RB0D34                 :1;
        unsigned RB0D35                 :1;
        unsigned RB0D36                 :1;
        unsigned RB0D37                 :1;
    };
} RXB0D3bits_t;
extern volatile RXB0D3bits_t RXB0D3bits __at(0xF69);
// bitfield macros
#define _RXB0D3_RXB0D30_POSN                                0x0
#define _RXB0D3_RXB0D30_POSITION                            0x0
#define _RXB0D3_RXB0D30_SIZE                                0x1
#define _RXB0D3_RXB0D30_LENGTH                              0x1
#define _RXB0D3_RXB0D30_MASK                                0x1
#define _RXB0D3_RXB0D31_POSN                                0x1
#define _RXB0D3_RXB0D31_POSITION                            0x1
#define _RXB0D3_RXB0D31_SIZE                                0x1
#define _RXB0D3_RXB0D31_LENGTH                              0x1
#define _RXB0D3_RXB0D31_MASK                                0x2
#define _RXB0D3_RXB0D32_POSN                                0x2
#define _RXB0D3_RXB0D32_POSITION                            0x2
#define _RXB0D3_RXB0D32_SIZE                                0x1
#define _RXB0D3_RXB0D32_LENGTH                              0x1
#define _RXB0D3_RXB0D32_MASK                                0x4
#define _RXB0D3_RXB0D33_POSN                                0x3
#define _RXB0D3_RXB0D33_POSITION                            0x3
#define _RXB0D3_RXB0D33_SIZE                                0x1
#define _RXB0D3_RXB0D33_LENGTH                              0x1
#define _RXB0D3_RXB0D33_MASK                                0x8
#define _RXB0D3_RXB0D34_POSN                                0x4
#define _RXB0D3_RXB0D34_POSITION                            0x4
#define _RXB0D3_RXB0D34_SIZE                                0x1
#define _RXB0D3_RXB0D34_LENGTH                              0x1
#define _RXB0D3_RXB0D34_MASK                                0x10
#define _RXB0D3_RXB0D35_POSN                                0x5
#define _RXB0D3_RXB0D35_POSITION                            0x5
#define _RXB0D3_RXB0D35_SIZE                                0x1
#define _RXB0D3_RXB0D35_LENGTH                              0x1
#define _RXB0D3_RXB0D35_MASK                                0x20
#define _RXB0D3_RXB0D36_POSN                                0x6
#define _RXB0D3_RXB0D36_POSITION                            0x6
#define _RXB0D3_RXB0D36_SIZE                                0x1
#define _RXB0D3_RXB0D36_LENGTH                              0x1
#define _RXB0D3_RXB0D36_MASK                                0x40
#define _RXB0D3_RXB0D37_POSN                                0x7
#define _RXB0D3_RXB0D37_POSITION                            0x7
#define _RXB0D3_RXB0D37_SIZE                                0x1
#define _RXB0D3_RXB0D37_LENGTH                              0x1
#define _RXB0D3_RXB0D37_MASK                                0x80
#define _RXB0D3_RB0D30_POSN                                 0x0
#define _RXB0D3_RB0D30_POSITION                             0x0
#define _RXB0D3_RB0D30_SIZE                                 0x1
#define _RXB0D3_RB0D30_LENGTH                               0x1
#define _RXB0D3_RB0D30_MASK                                 0x1
#define _RXB0D3_RB0D31_POSN                                 0x1
#define _RXB0D3_RB0D31_POSITION                             0x1
#define _RXB0D3_RB0D31_SIZE                                 0x1
#define _RXB0D3_RB0D31_LENGTH                               0x1
#define _RXB0D3_RB0D31_MASK                                 0x2
#define _RXB0D3_RB0D32_POSN                                 0x2
#define _RXB0D3_RB0D32_POSITION                             0x2
#define _RXB0D3_RB0D32_SIZE                                 0x1
#define _RXB0D3_RB0D32_LENGTH                               0x1
#define _RXB0D3_RB0D32_MASK                                 0x4
#define _RXB0D3_RB0D33_POSN                                 0x3
#define _RXB0D3_RB0D33_POSITION                             0x3
#define _RXB0D3_RB0D33_SIZE                                 0x1
#define _RXB0D3_RB0D33_LENGTH                               0x1
#define _RXB0D3_RB0D33_MASK                                 0x8
#define _RXB0D3_RB0D34_POSN                                 0x4
#define _RXB0D3_RB0D34_POSITION                             0x4
#define _RXB0D3_RB0D34_SIZE                                 0x1
#define _RXB0D3_RB0D34_LENGTH                               0x1
#define _RXB0D3_RB0D34_MASK                                 0x10
#define _RXB0D3_RB0D35_POSN                                 0x5
#define _RXB0D3_RB0D35_POSITION                             0x5
#define _RXB0D3_RB0D35_SIZE                                 0x1
#define _RXB0D3_RB0D35_LENGTH                               0x1
#define _RXB0D3_RB0D35_MASK                                 0x20
#define _RXB0D3_RB0D36_POSN                                 0x6
#define _RXB0D3_RB0D36_POSITION                             0x6
#define _RXB0D3_RB0D36_SIZE                                 0x1
#define _RXB0D3_RB0D36_LENGTH                               0x1
#define _RXB0D3_RB0D36_MASK                                 0x40
#define _RXB0D3_RB0D37_POSN                                 0x7
#define _RXB0D3_RB0D37_POSITION                             0x7
#define _RXB0D3_RB0D37_SIZE                                 0x1
#define _RXB0D3_RB0D37_LENGTH                               0x1
#define _RXB0D3_RB0D37_MASK                                 0x80

