MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
// Register: RXB0D4
#define RXB0D4 RXB0D4
extern volatile unsigned char           RXB0D4              __at(0xF6A);
#ifndef _LIB_BUILD
asm("RXB0D4 equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D40                :1;
        unsigned RXB0D41                :1;
        unsigned RXB0D42                :1;
        unsigned RXB0D43                :1;
        unsigned RXB0D44                :1;
        unsigned RXB0D45                :1;
        unsigned RXB0D46                :1;
        unsigned RXB0D47                :1;
    };
    struct {
        unsigned RB0D40                 :1;
        unsigned RB0D41                 :1;
        unsigned RB0D42                 :1;
        unsigned RB0D43                 :1;
        unsigned RB0D44                 :1;
        unsigned RB0D45                 :1;
        unsigned RB0D46                 :1;
        unsigned RB0D47                 :1;
    };
} RXB0D4bits_t;
extern volatile RXB0D4bits_t RXB0D4bits __at(0xF6A);
// bitfield macros
#define _RXB0D4_RXB0D40_POSN                                0x0
#define _RXB0D4_RXB0D40_POSITION                            0x0
#define _RXB0D4_RXB0D40_SIZE                                0x1
#define _RXB0D4_RXB0D40_LENGTH                              0x1
#define _RXB0D4_RXB0D40_MASK                                0x1
#define _RXB0D4_RXB0D41_POSN                                0x1
#define _RXB0D4_RXB0D41_POSITION                            0x1
#define _RXB0D4_RXB0D41_SIZE                                0x1
#define _RXB0D4_RXB0D41_LENGTH                              0x1
#define _RXB0D4_RXB0D41_MASK                                0x2
#define _RXB0D4_RXB0D42_POSN                                0x2
#define _RXB0D4_RXB0D42_POSITION                            0x2
#define _RXB0D4_RXB0D42_SIZE                                0x1
#define _RXB0D4_RXB0D42_LENGTH                              0x1
#define _RXB0D4_RXB0D42_MASK                                0x4
#define _RXB0D4_RXB0D43_POSN                                0x3
#define _RXB0D4_RXB0D43_POSITION                            0x3
#define _RXB0D4_RXB0D43_SIZE                                0x1
#define _RXB0D4_RXB0D43_LENGTH                              0x1
#define _RXB0D4_RXB0D43_MASK                                0x8
#define _RXB0D4_RXB0D44_POSN                                0x4
#define _RXB0D4_RXB0D44_POSITION                            0x4
#define _RXB0D4_RXB0D44_SIZE                                0x1
#define _RXB0D4_RXB0D44_LENGTH                              0x1
#define _RXB0D4_RXB0D44_MASK                                0x10
#define _RXB0D4_RXB0D45_POSN                                0x5
#define _RXB0D4_RXB0D45_POSITION                            0x5
#define _RXB0D4_RXB0D45_SIZE                                0x1
#define _RXB0D4_RXB0D45_LENGTH                              0x1
#define _RXB0D4_RXB0D45_MASK                                0x20
#define _RXB0D4_RXB0D46_POSN                                0x6
#define _RXB0D4_RXB0D46_POSITION                            0x6
#define _RXB0D4_RXB0D46_SIZE                                0x1
#define _RXB0D4_RXB0D46_LENGTH                              0x1
#define _RXB0D4_RXB0D46_MASK                                0x40
#define _RXB0D4_RXB0D47_POSN                                0x7
#define _RXB0D4_RXB0D47_POSITION                            0x7
#define _RXB0D4_RXB0D47_SIZE                                0x1
#define _RXB0D4_RXB0D47_LENGTH                              0x1
#define _RXB0D4_RXB0D47_MASK                                0x80
#define _RXB0D4_RB0D40_POSN                                 0x0
#define _RXB0D4_RB0D40_POSITION                             0x0
#define _RXB0D4_RB0D40_SIZE                                 0x1
#define _RXB0D4_RB0D40_LENGTH                               0x1
#define _RXB0D4_RB0D40_MASK                                 0x1
#define _RXB0D4_RB0D41_POSN                                 0x1
#define _RXB0D4_RB0D41_POSITION                             0x1
#define _RXB0D4_RB0D41_SIZE                                 0x1
#define _RXB0D4_RB0D41_LENGTH                               0x1
#define _RXB0D4_RB0D41_MASK                                 0x2
#define _RXB0D4_RB0D42_POSN                                 0x2
#define _RXB0D4_RB0D42_POSITION                             0x2
#define _RXB0D4_RB0D42_SIZE                                 0x1
#define _RXB0D4_RB0D42_LENGTH                               0x1
#define _RXB0D4_RB0D42_MASK                                 0x4
#define _RXB0D4_RB0D43_POSN                                 0x3
#define _RXB0D4_RB0D43_POSITION                             0x3
#define _RXB0D4_RB0D43_SIZE                                 0x1
#define _RXB0D4_RB0D43_LENGTH                               0x1
#define _RXB0D4_RB0D43_MASK                                 0x8
#define _RXB0D4_RB0D44_POSN                                 0x4
#define _RXB0D4_RB0D44_POSITION                             0x4
#define _RXB0D4_RB0D44_SIZE                                 0x1
#define _RXB0D4_RB0D44_LENGTH                               0x1
#define _RXB0D4_RB0D44_MASK                                 0x10
#define _RXB0D4_RB0D45_POSN                                 0x5
#define _RXB0D4_RB0D45_POSITION                             0x5
#define _RXB0D4_RB0D45_SIZE                                 0x1
#define _RXB0D4_RB0D45_LENGTH                               0x1
#define _RXB0D4_RB0D45_MASK                                 0x20
#define _RXB0D4_RB0D46_POSN                                 0x6
#define _RXB0D4_RB0D46_POSITION                             0x6
#define _RXB0D4_RB0D46_SIZE                                 0x1
#define _RXB0D4_RB0D46_LENGTH                               0x1
#define _RXB0D4_RB0D46_MASK                                 0x40
#define _RXB0D4_RB0D47_POSN                                 0x7
#define _RXB0D4_RB0D47_POSITION                             0x7
#define _RXB0D4_RB0D47_SIZE                                 0x1
#define _RXB0D4_RB0D47_LENGTH                               0x1
#define _RXB0D4_RB0D47_MASK                                 0x80

// Register: RXB0D5
#define RXB0D5 RXB0D5
extern volatile unsigned char           RXB0D5              __at(0xF6B);
#ifndef _LIB_BUILD
asm("RXB0D5 equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D50                :1;
        unsigned RXB0D51                :1;
        unsigned RXB0D52                :1;
        unsigned RXB0D53                :1;
        unsigned RXB0D54                :1;
        unsigned RXB0D55                :1;
        unsigned RXB0D56                :1;
        unsigned RXB0D57                :1;
    };
    struct {
        unsigned RB0D50                 :1;
        unsigned RB0D51                 :1;
        unsigned RB0D52                 :1;
        unsigned RB0D53                 :1;
        unsigned RB0D54                 :1;
        unsigned RB0D55                 :1;
        unsigned RB0D56                 :1;
        unsigned RB0D57                 :1;
    };
} RXB0D5bits_t;
