MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
extern volatile PIE3bits_t PIE3bits __at(0xFA3);
// bitfield macros
#define _PIE3_RXB0IE_POSN                                   0x0
#define _PIE3_RXB0IE_POSITION                               0x0
#define _PIE3_RXB0IE_SIZE                                   0x1
#define _PIE3_RXB0IE_LENGTH                                 0x1
#define _PIE3_RXB0IE_MASK                                   0x1
#define _PIE3_RXB1IE_POSN                                   0x1
#define _PIE3_RXB1IE_POSITION                               0x1
#define _PIE3_RXB1IE_SIZE                                   0x1
#define _PIE3_RXB1IE_LENGTH                                 0x1
#define _PIE3_RXB1IE_MASK                                   0x2
#define _PIE3_TXB0IE_POSN                                   0x2
#define _PIE3_TXB0IE_POSITION                               0x2
#define _PIE3_TXB0IE_SIZE                                   0x1
#define _PIE3_TXB0IE_LENGTH                                 0x1
#define _PIE3_TXB0IE_MASK                                   0x4
#define _PIE3_TXB1IE_POSN                                   0x3
#define _PIE3_TXB1IE_POSITION                               0x3
#define _PIE3_TXB1IE_SIZE                                   0x1
#define _PIE3_TXB1IE_LENGTH                                 0x1
#define _PIE3_TXB1IE_MASK                                   0x8
#define _PIE3_TXB2IE_POSN                                   0x4
#define _PIE3_TXB2IE_POSITION                               0x4
#define _PIE3_TXB2IE_SIZE                                   0x1
#define _PIE3_TXB2IE_LENGTH                                 0x1
#define _PIE3_TXB2IE_MASK                                   0x10
#define _PIE3_ERRIE_POSN                                    0x5
#define _PIE3_ERRIE_POSITION                                0x5
#define _PIE3_ERRIE_SIZE                                    0x1
#define _PIE3_ERRIE_LENGTH                                  0x1
#define _PIE3_ERRIE_MASK                                    0x20
#define _PIE3_WAKIE_POSN                                    0x6
#define _PIE3_WAKIE_POSITION                                0x6
#define _PIE3_WAKIE_SIZE                                    0x1
#define _PIE3_WAKIE_LENGTH                                  0x1
#define _PIE3_WAKIE_MASK                                    0x40
#define _PIE3_IRXIE_POSN                                    0x7
#define _PIE3_IRXIE_POSITION                                0x7
#define _PIE3_IRXIE_SIZE                                    0x1
#define _PIE3_IRXIE_LENGTH                                  0x1
#define _PIE3_IRXIE_MASK                                    0x80
#define _PIE3_RX0IE_POSN                                    0x0
#define _PIE3_RX0IE_POSITION                                0x0
#define _PIE3_RX0IE_SIZE                                    0x1
#define _PIE3_RX0IE_LENGTH                                  0x1
#define _PIE3_RX0IE_MASK                                    0x1
#define _PIE3_RX1IE_POSN                                    0x1
#define _PIE3_RX1IE_POSITION                                0x1
#define _PIE3_RX1IE_SIZE                                    0x1
#define _PIE3_RX1IE_LENGTH                                  0x1
#define _PIE3_RX1IE_MASK                                    0x2
#define _PIE3_TX0IE_POSN                                    0x2
#define _PIE3_TX0IE_POSITION                                0x2
#define _PIE3_TX0IE_SIZE                                    0x1
#define _PIE3_TX0IE_LENGTH                                  0x1
#define _PIE3_TX0IE_MASK                                    0x4
#define _PIE3_TX1IE_POSN                                    0x3
#define _PIE3_TX1IE_POSITION                                0x3
#define _PIE3_TX1IE_SIZE                                    0x1
#define _PIE3_TX1IE_LENGTH                                  0x1
#define _PIE3_TX1IE_MASK                                    0x8
#define _PIE3_TX2IE_POSN                                    0x4
#define _PIE3_TX2IE_POSITION                                0x4
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x10
#define _PIE3_IVRE_POSN                                     0x7
#define _PIE3_IVRE_POSITION                                 0x7
#define _PIE3_IVRE_SIZE                                     0x1
#define _PIE3_IVRE_LENGTH                                   0x1
#define _PIE3_IVRE_MASK                                     0x80
#define _PIE3_RXBNIE_POSN                                   0x1
#define _PIE3_RXBNIE_POSITION                               0x1
#define _PIE3_RXBNIE_SIZE                                   0x1
#define _PIE3_RXBNIE_LENGTH                                 0x1
#define _PIE3_RXBNIE_MASK                                   0x2
#define _PIE3_TXBNIE_POSN                                   0x4
#define _PIE3_TXBNIE_POSITION                               0x4
#define _PIE3_TXBNIE_SIZE                                   0x1
#define _PIE3_TXBNIE_LENGTH                                 0x1
#define _PIE3_TXBNIE_MASK                                   0x10

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0xFA4);
#ifndef _LIB_BUILD
asm("PIR3 equ 0FA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IF                 :1;
        unsigned RXB1IF                 :1;
        unsigned TXB0IF                 :1;
        unsigned TXB1IF                 :1;
        unsigned TXB2IF                 :1;
        unsigned ERRIF                  :1;
        unsigned WAKIF                  :1;
        unsigned IRXIF                  :1;
    };
    struct {
        unsigned RX0IF                  :1;
        unsigned RX1IF                  :1;
        unsigned TX0IF                  :1;
        unsigned TX1IF                  :1;
        unsigned TX2IF                  :1;
        unsigned                        :2;
        unsigned IVRF                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIF                 :1;
        unsigned                        :2;
        unsigned TXBNIF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0xFA4);
// bitfield macros
#define _PIR3_RXB0IF_POSN                                   0x0
#define _PIR3_RXB0IF_POSITION                               0x0
#define _PIR3_RXB0IF_SIZE                                   0x1
#define _PIR3_RXB0IF_LENGTH                                 0x1
#define _PIR3_RXB0IF_MASK                                   0x1
#define _PIR3_RXB1IF_POSN                                   0x1
#define _PIR3_RXB1IF_POSITION                               0x1
#define _PIR3_RXB1IF_SIZE                                   0x1
#define _PIR3_RXB1IF_LENGTH                                 0x1
#define _PIR3_RXB1IF_MASK                                   0x2
#define _PIR3_TXB0IF_POSN                                   0x2
#define _PIR3_TXB0IF_POSITION                               0x2
#define _PIR3_TXB0IF_SIZE                                   0x1
#define _PIR3_TXB0IF_LENGTH                                 0x1
#define _PIR3_TXB0IF_MASK                                   0x4
#define _PIR3_TXB1IF_POSN                                   0x3
#define _PIR3_TXB1IF_POSITION                               0x3
#define _PIR3_TXB1IF_SIZE                                   0x1
#define _PIR3_TXB1IF_LENGTH                                 0x1
#define _PIR3_TXB1IF_MASK                                   0x8
#define _PIR3_TXB2IF_POSN                                   0x4
#define _PIR3_TXB2IF_POSITION                               0x4
#define _PIR3_TXB2IF_SIZE                                   0x1
#define _PIR3_TXB2IF_LENGTH                                 0x1
#define _PIR3_TXB2IF_MASK                                   0x10
#define _PIR3_ERRIF_POSN                                    0x5
#define _PIR3_ERRIF_POSITION                                0x5
#define _PIR3_ERRIF_SIZE                                    0x1
#define _PIR3_ERRIF_LENGTH                                  0x1
#define _PIR3_ERRIF_MASK                                    0x20
#define _PIR3_WAKIF_POSN                                    0x6
#define _PIR3_WAKIF_POSITION                                0x6
#define _PIR3_WAKIF_SIZE                                    0x1
#define _PIR3_WAKIF_LENGTH                                  0x1
#define _PIR3_WAKIF_MASK                                    0x40
#define _PIR3_IRXIF_POSN                                    0x7
#define _PIR3_IRXIF_POSITION                                0x7
#define _PIR3_IRXIF_SIZE                                    0x1
#define _PIR3_IRXIF_LENGTH                                  0x1
#define _PIR3_IRXIF_MASK                                    0x80
#define _PIR3_RX0IF_POSN                                    0x0
#define _PIR3_RX0IF_POSITION                                0x0
#define _PIR3_RX0IF_SIZE                                    0x1
#define _PIR3_RX0IF_LENGTH                                  0x1
#define _PIR3_RX0IF_MASK                                    0x1
#define _PIR3_RX1IF_POSN                                    0x1
#define _PIR3_RX1IF_POSITION                                0x1
#define _PIR3_RX1IF_SIZE                                    0x1
#define _PIR3_RX1IF_LENGTH                                  0x1
#define _PIR3_RX1IF_MASK                                    0x2
#define _PIR3_TX0IF_POSN                                    0x2
#define _PIR3_TX0IF_POSITION                                0x2
#define _PIR3_TX0IF_SIZE                                    0x1
#define _PIR3_TX0IF_LENGTH                                  0x1
#define _PIR3_TX0IF_MASK                                    0x4
#define _PIR3_TX1IF_POSN                                    0x3
#define _PIR3_TX1IF_POSITION                                0x3
#define _PIR3_TX1IF_SIZE                                    0x1
#define _PIR3_TX1IF_LENGTH                                  0x1
#define _PIR3_TX1IF_MASK                                    0x8
#define _PIR3_TX2IF_POSN                                    0x4
#define _PIR3_TX2IF_POSITION                                0x4
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x10
#define _PIR3_IVRF_POSN                                     0x7
#define _PIR3_IVRF_POSITION                                 0x7
#define _PIR3_IVRF_SIZE                                     0x1
#define _PIR3_IVRF_LENGTH                                   0x1
#define _PIR3_IVRF_MASK                                     0x80
#define _PIR3_RXBNIF_POSN                                   0x1
#define _PIR3_RXBNIF_POSITION                               0x1
#define _PIR3_RXBNIF_SIZE                                   0x1
#define _PIR3_RXBNIF_LENGTH                                 0x1
#define _PIR3_RXBNIF_MASK                                   0x2
#define _PIR3_TXBNIF_POSN                                   0x4
#define _PIR3_TXBNIF_POSITION                               0x4
#define _PIR3_TXBNIF_SIZE                                   0x1
#define _PIR3_TXBNIF_LENGTH                                 0x1
#define _PIR3_TXBNIF_MASK                                   0x10

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0xFA5);
#ifndef _LIB_BUILD
asm("IPR3 equ 0FA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IP                 :1;
        unsigned RXB1IP                 :1;
        unsigned TXB0IP                 :1;
        unsigned TXB1IP                 :1;
        unsigned TXB2IP                 :1;
        unsigned ERRIP                  :1;
        unsigned WAKIP                  :1;
        unsigned IRXIP                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned IVRP                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIP                 :1;
        unsigned                        :2;
        unsigned TXBNIP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0xFA5);
// bitfield macros
#define _IPR3_RXB0IP_POSN                                   0x0
#define _IPR3_RXB0IP_POSITION                               0x0
#define _IPR3_RXB0IP_SIZE                                   0x1
#define _IPR3_RXB0IP_LENGTH                                 0x1
#define _IPR3_RXB0IP_MASK                                   0x1
#define _IPR3_RXB1IP_POSN                                   0x1
#define _IPR3_RXB1IP_POSITION                               0x1
#define _IPR3_RXB1IP_SIZE                                   0x1
#define _IPR3_RXB1IP_LENGTH                                 0x1
#define _IPR3_RXB1IP_MASK                                   0x2
#define _IPR3_TXB0IP_POSN                                   0x2
#define _IPR3_TXB0IP_POSITION                               0x2
#define _IPR3_TXB0IP_SIZE                                   0x1
#define _IPR3_TXB0IP_LENGTH                                 0x1
#define _IPR3_TXB0IP_MASK                                   0x4
#define _IPR3_TXB1IP_POSN                                   0x3
#define _IPR3_TXB1IP_POSITION                               0x3
#define _IPR3_TXB1IP_SIZE                                   0x1
#define _IPR3_TXB1IP_LENGTH                                 0x1
#define _IPR3_TXB1IP_MASK                                   0x8
#define _IPR3_TXB2IP_POSN                                   0x4
#define _IPR3_TXB2IP_POSITION                               0x4
#define _IPR3_TXB2IP_SIZE                                   0x1
#define _IPR3_TXB2IP_LENGTH                                 0x1
#define _IPR3_TXB2IP_MASK                                   0x10
#define _IPR3_ERRIP_POSN                                    0x5
#define _IPR3_ERRIP_POSITION                                0x5
#define _IPR3_ERRIP_SIZE                                    0x1
#define _IPR3_ERRIP_LENGTH                                  0x1
#define _IPR3_ERRIP_MASK                                    0x20
#define _IPR3_WAKIP_POSN                                    0x6
#define _IPR3_WAKIP_POSITION                                0x6
#define _IPR3_WAKIP_SIZE                                    0x1
#define _IPR3_WAKIP_LENGTH                                  0x1
#define _IPR3_WAKIP_MASK                                    0x40
#define _IPR3_IRXIP_POSN                                    0x7
#define _IPR3_IRXIP_POSITION                                0x7
#define _IPR3_IRXIP_SIZE                                    0x1
#define _IPR3_IRXIP_LENGTH                                  0x1
#define _IPR3_IRXIP_MASK                                    0x80
#define _IPR3_IVRP_POSN                                     0x7
#define _IPR3_IVRP_POSITION                                 0x7
#define _IPR3_IVRP_SIZE                                     0x1
#define _IPR3_IVRP_LENGTH                                   0x1
#define _IPR3_IVRP_MASK                                     0x80
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0xFA6);
#ifndef _LIB_BUILD
asm("EECON1 equ 0FA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned                        :1;
        unsigned CFGS                   :1;
        unsigned EEPGD                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned EEFS                   :1;
    };
} EECON1bits_t;
