MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
extern volatile __bit                   RXB1D14             __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 RXB1D14_bit         _BIT_ACCESS(RXB1D1,4)
// RXB1D1<RXB1D15>
extern volatile __bit                   RXB1D15             __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 RXB1D15_bit         _BIT_ACCESS(RXB1D1,5)
// RXB1D1<RXB1D16>
extern volatile __bit                   RXB1D16             __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 RXB1D16_bit         _BIT_ACCESS(RXB1D1,6)
// RXB1D1<RXB1D17>
extern volatile __bit                   RXB1D17             __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 RXB1D17_bit         _BIT_ACCESS(RXB1D1,7)
// RXB1D2<RXB1D20>
extern volatile __bit                   RXB1D20             __at(0x7AC0);	// @ (0xF58 * 8 + 0)
#define                                 RXB1D20_bit         _BIT_ACCESS(RXB1D2,0)
// RXB1D2<RXB1D21>
extern volatile __bit                   RXB1D21             __at(0x7AC1);	// @ (0xF58 * 8 + 1)
#define                                 RXB1D21_bit         _BIT_ACCESS(RXB1D2,1)
// RXB1D2<RXB1D22>
extern volatile __bit                   RXB1D22             __at(0x7AC2);	// @ (0xF58 * 8 + 2)
#define                                 RXB1D22_bit         _BIT_ACCESS(RXB1D2,2)
// RXB1D2<RXB1D23>
extern volatile __bit                   RXB1D23             __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 RXB1D23_bit         _BIT_ACCESS(RXB1D2,3)
// RXB1D2<RXB1D24>
extern volatile __bit                   RXB1D24             __at(0x7AC4);	// @ (0xF58 * 8 + 4)
#define                                 RXB1D24_bit         _BIT_ACCESS(RXB1D2,4)
// RXB1D2<RXB1D25>
extern volatile __bit                   RXB1D25             __at(0x7AC5);	// @ (0xF58 * 8 + 5)
#define                                 RXB1D25_bit         _BIT_ACCESS(RXB1D2,5)
// RXB1D2<RXB1D26>
extern volatile __bit                   RXB1D26             __at(0x7AC6);	// @ (0xF58 * 8 + 6)
#define                                 RXB1D26_bit         _BIT_ACCESS(RXB1D2,6)
// RXB1D2<RXB1D27>
extern volatile __bit                   RXB1D27             __at(0x7AC7);	// @ (0xF58 * 8 + 7)
#define                                 RXB1D27_bit         _BIT_ACCESS(RXB1D2,7)
// RXB1D3<RXB1D30>
extern volatile __bit                   RXB1D30             __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 RXB1D30_bit         _BIT_ACCESS(RXB1D3,0)
// RXB1D3<RXB1D31>
extern volatile __bit                   RXB1D31             __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 RXB1D31_bit         _BIT_ACCESS(RXB1D3,1)
// RXB1D3<RXB1D32>
extern volatile __bit                   RXB1D32             __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 RXB1D32_bit         _BIT_ACCESS(RXB1D3,2)
// RXB1D3<RXB1D33>
extern volatile __bit                   RXB1D33             __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 RXB1D33_bit         _BIT_ACCESS(RXB1D3,3)
// RXB1D3<RXB1D34>
extern volatile __bit                   RXB1D34             __at(0x7ACC);	// @ (0xF59 * 8 + 4)
#define                                 RXB1D34_bit         _BIT_ACCESS(RXB1D3,4)
// RXB1D3<RXB1D35>
extern volatile __bit                   RXB1D35             __at(0x7ACD);	// @ (0xF59 * 8 + 5)
#define                                 RXB1D35_bit         _BIT_ACCESS(RXB1D3,5)
// RXB1D3<RXB1D36>
extern volatile __bit                   RXB1D36             __at(0x7ACE);	// @ (0xF59 * 8 + 6)
#define                                 RXB1D36_bit         _BIT_ACCESS(RXB1D3,6)
// RXB1D3<RXB1D37>
extern volatile __bit                   RXB1D37             __at(0x7ACF);	// @ (0xF59 * 8 + 7)
#define                                 RXB1D37_bit         _BIT_ACCESS(RXB1D3,7)
// RXB1D4<RXB1D40>
extern volatile __bit                   RXB1D40             __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 RXB1D40_bit         _BIT_ACCESS(RXB1D4,0)
// RXB1D4<RXB1D41>
extern volatile __bit                   RXB1D41             __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 RXB1D41_bit         _BIT_ACCESS(RXB1D4,1)
// RXB1D4<RXB1D42>
extern volatile __bit                   RXB1D42             __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 RXB1D42_bit         _BIT_ACCESS(RXB1D4,2)
// RXB1D4<RXB1D43>
extern volatile __bit                   RXB1D43             __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 RXB1D43_bit         _BIT_ACCESS(RXB1D4,3)
// RXB1D4<RXB1D44>
extern volatile __bit                   RXB1D44             __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 RXB1D44_bit         _BIT_ACCESS(RXB1D4,4)
// RXB1D4<RXB1D45>
extern volatile __bit                   RXB1D45             __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 RXB1D45_bit         _BIT_ACCESS(RXB1D4,5)
// RXB1D4<RXB1D46>
extern volatile __bit                   RXB1D46             __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 RXB1D46_bit         _BIT_ACCESS(RXB1D4,6)
// RXB1D4<RXB1D47>
extern volatile __bit                   RXB1D47             __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 RXB1D47_bit         _BIT_ACCESS(RXB1D4,7)
// RXB1D5<RXB1D50>
extern volatile __bit                   RXB1D50             __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 RXB1D50_bit         _BIT_ACCESS(RXB1D5,0)
// RXB1D5<RXB1D51>
extern volatile __bit                   RXB1D51             __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 RXB1D51_bit         _BIT_ACCESS(RXB1D5,1)
// RXB1D5<RXB1D52>
extern volatile __bit                   RXB1D52             __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 RXB1D52_bit         _BIT_ACCESS(RXB1D5,2)
// RXB1D5<RXB1D53>
extern volatile __bit                   RXB1D53             __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 RXB1D53_bit         _BIT_ACCESS(RXB1D5,3)
// RXB1D5<RXB1D54>
extern volatile __bit                   RXB1D54             __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 RXB1D54_bit         _BIT_ACCESS(RXB1D5,4)
// RXB1D5<RXB1D55>
extern volatile __bit                   RXB1D55             __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 RXB1D55_bit         _BIT_ACCESS(RXB1D5,5)
// RXB1D5<RXB1D56>
extern volatile __bit                   RXB1D56             __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 RXB1D56_bit         _BIT_ACCESS(RXB1D5,6)
// RXB1D5<RXB1D57>
extern volatile __bit                   RXB1D57             __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 RXB1D57_bit         _BIT_ACCESS(RXB1D5,7)
// RXB1D6<RXB1D60>
extern volatile __bit                   RXB1D60             __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 RXB1D60_bit         _BIT_ACCESS(RXB1D6,0)
// RXB1D6<RXB1D61>
extern volatile __bit                   RXB1D61             __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 RXB1D61_bit         _BIT_ACCESS(RXB1D6,1)
// RXB1D6<RXB1D62>
extern volatile __bit                   RXB1D62             __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 RXB1D62_bit         _BIT_ACCESS(RXB1D6,2)
// RXB1D6<RXB1D63>
extern volatile __bit                   RXB1D63             __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 RXB1D63_bit         _BIT_ACCESS(RXB1D6,3)
// RXB1D6<RXB1D64>
extern volatile __bit                   RXB1D64             __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 RXB1D64_bit         _BIT_ACCESS(RXB1D6,4)
// RXB1D6<RXB1D65>
extern volatile __bit                   RXB1D65             __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 RXB1D65_bit         _BIT_ACCESS(RXB1D6,5)
// RXB1D6<RXB1D66>
extern volatile __bit                   RXB1D66             __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 RXB1D66_bit         _BIT_ACCESS(RXB1D6,6)
// RXB1D6<RXB1D67>
extern volatile __bit                   RXB1D67             __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 RXB1D67_bit         _BIT_ACCESS(RXB1D6,7)
// RXB1D7<RXB1D70>
extern volatile __bit                   RXB1D70             __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 RXB1D70_bit         _BIT_ACCESS(RXB1D7,0)
// RXB1D7<RXB1D71>
extern volatile __bit                   RXB1D71             __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 RXB1D71_bit         _BIT_ACCESS(RXB1D7,1)
// RXB1D7<RXB1D72>
extern volatile __bit                   RXB1D72             __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 RXB1D72_bit         _BIT_ACCESS(RXB1D7,2)
// RXB1D7<RXB1D73>
extern volatile __bit                   RXB1D73             __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 RXB1D73_bit         _BIT_ACCESS(RXB1D7,3)
// RXB1D7<RXB1D74>
extern volatile __bit                   RXB1D74             __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 RXB1D74_bit         _BIT_ACCESS(RXB1D7,4)
// RXB1D7<RXB1D75>
extern volatile __bit                   RXB1D75             __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 RXB1D75_bit         _BIT_ACCESS(RXB1D7,5)
// RXB1D7<RXB1D76>
extern volatile __bit                   RXB1D76             __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 RXB1D76_bit         _BIT_ACCESS(RXB1D7,6)
// RXB1D7<RXB1D77>
extern volatile __bit                   RXB1D77             __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 RXB1D77_bit         _BIT_ACCESS(RXB1D7,7)
// RXB1DLC<RXB1DLC0>
extern volatile __bit                   RXB1DLC0            __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 RXB1DLC0_bit        _BIT_ACCESS(RXB1DLC,0)
// RXB1DLC<RXB1DLC1>
extern volatile __bit                   RXB1DLC1            __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 RXB1DLC1_bit        _BIT_ACCESS(RXB1DLC,1)
// RXB1DLC<RXB1DLC2>
extern volatile __bit                   RXB1DLC2            __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 RXB1DLC2_bit        _BIT_ACCESS(RXB1DLC,2)
// RXB1DLC<RXB1DLC3>
extern volatile __bit                   RXB1DLC3            __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 RXB1DLC3_bit        _BIT_ACCESS(RXB1DLC,3)
// RXB1EIDL<RXB1EID0>
extern volatile __bit                   RXB1EID0            __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 RXB1EID0_bit        _BIT_ACCESS(RXB1EIDL,0)
// RXB1EIDL<RXB1EID1>
extern volatile __bit                   RXB1EID1            __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 RXB1EID1_bit        _BIT_ACCESS(RXB1EIDL,1)
// RXB1EIDH<RXB1EID10>
extern volatile __bit                   RXB1EID10           __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 RXB1EID10_bit       _BIT_ACCESS(RXB1EIDH,2)
// RXB1EIDH<RXB1EID11>
extern volatile __bit                   RXB1EID11           __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 RXB1EID11_bit       _BIT_ACCESS(RXB1EIDH,3)
// RXB1EIDH<RXB1EID12>
extern volatile __bit                   RXB1EID12           __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 RXB1EID12_bit       _BIT_ACCESS(RXB1EIDH,4)
// RXB1EIDH<RXB1EID13>
extern volatile __bit                   RXB1EID13           __at(0x7A9D);	// @ (0xF53 * 8 + 5)
#define                                 RXB1EID13_bit       _BIT_ACCESS(RXB1EIDH,5)
// RXB1EIDH<RXB1EID14>
extern volatile __bit                   RXB1EID14           __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 RXB1EID14_bit       _BIT_ACCESS(RXB1EIDH,6)
// RXB1EIDH<RXB1EID15>
extern volatile __bit                   RXB1EID15           __at(0x7A9F);	// @ (0xF53 * 8 + 7)
#define                                 RXB1EID15_bit       _BIT_ACCESS(RXB1EIDH,7)
// RXB1SIDL<RXB1EID16>
extern volatile __bit                   RXB1EID16           __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 RXB1EID16_bit       _BIT_ACCESS(RXB1SIDL,0)
// RXB1SIDL<RXB1EID17>
extern volatile __bit                   RXB1EID17           __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 RXB1EID17_bit       _BIT_ACCESS(RXB1SIDL,1)
// RXB1EIDL<RXB1EID2>
extern volatile __bit                   RXB1EID2            __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 RXB1EID2_bit        _BIT_ACCESS(RXB1EIDL,2)
// RXB1EIDL<RXB1EID3>
extern volatile __bit                   RXB1EID3            __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 RXB1EID3_bit        _BIT_ACCESS(RXB1EIDL,3)
// RXB1EIDL<RXB1EID4>
extern volatile __bit                   RXB1EID4            __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 RXB1EID4_bit        _BIT_ACCESS(RXB1EIDL,4)
// RXB1EIDL<RXB1EID5>
extern volatile __bit                   RXB1EID5            __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 RXB1EID5_bit        _BIT_ACCESS(RXB1EIDL,5)
// RXB1EIDL<RXB1EID6>
extern volatile __bit                   RXB1EID6            __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 RXB1EID6_bit        _BIT_ACCESS(RXB1EIDL,6)
// RXB1EIDL<RXB1EID7>
extern volatile __bit                   RXB1EID7            __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 RXB1EID7_bit        _BIT_ACCESS(RXB1EIDL,7)
// RXB1EIDH<RXB1EID8>
extern volatile __bit                   RXB1EID8            __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 RXB1EID8_bit        _BIT_ACCESS(RXB1EIDH,0)
// RXB1EIDH<RXB1EID9>
extern volatile __bit                   RXB1EID9            __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 RXB1EID9_bit        _BIT_ACCESS(RXB1EIDH,1)
// RXB1SIDL<RXB1EXID>
extern volatile __bit                   RXB1EXID            __at(0x7A93);	// @ (0xF52 * 8 + 3)
#define                                 RXB1EXID_bit        _BIT_ACCESS(RXB1SIDL,3)
// RXB1CON<RXB1FILHIT0>
extern volatile __bit                   RXB1FILHIT0         __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 RXB1FILHIT0_bit     _BIT_ACCESS(RXB1CON,0)
// RXB1CON<RXB1FILHIT1>
extern volatile __bit                   RXB1FILHIT1         __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 RXB1FILHIT1_bit     _BIT_ACCESS(RXB1CON,1)
// RXB1CON<RXB1FILHIT2>
extern volatile __bit                   RXB1FILHIT2         __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 RXB1FILHIT2_bit     _BIT_ACCESS(RXB1CON,2)
// RXB1CON<RXB1FILHIT3>
extern volatile __bit                   RXB1FILHIT3         __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 RXB1FILHIT3_bit     _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1FUL>
extern volatile __bit                   RXB1FUL             __at(0x7A87);	// @ (0xF50 * 8 + 7)
#define                                 RXB1FUL_bit         _BIT_ACCESS(RXB1CON,7)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXB1IF>
extern volatile __bit                   RXB1IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXB1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXB1IP>
extern volatile __bit                   RXB1IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXB1IP_bit          _BIT_ACCESS(IPR3,1)
// RXB1CON<RXB1M0>
extern volatile __bit                   RXB1M0              __at(0x7A85);	// @ (0xF50 * 8 + 5)
#define                                 RXB1M0_bit          _BIT_ACCESS(RXB1CON,5)
// RXB1CON<RXB1M1>
extern volatile __bit                   RXB1M1              __at(0x7A86);	// @ (0xF50 * 8 + 6)
#define                                 RXB1M1_bit          _BIT_ACCESS(RXB1CON,6)
// COMSTAT<RXB1OVFL>
extern volatile __bit                   RXB1OVFL            __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 RXB1OVFL_bit        _BIT_ACCESS(COMSTAT,6)
// RXB1DLC<RXB1RB0>
extern volatile __bit                   RXB1RB0             __at(0x7AAC);	// @ (0xF55 * 8 + 4)
#define                                 RXB1RB0_bit         _BIT_ACCESS(RXB1DLC,4)
// RXB1DLC<RXB1RB1>
extern volatile __bit                   RXB1RB1             __at(0x7AAD);	// @ (0xF55 * 8 + 5)
#define                                 RXB1RB1_bit         _BIT_ACCESS(RXB1DLC,5)
// RXB1DLC<RXB1RTR>
extern volatile __bit                   RXB1RTR             __at(0x7AAE);	// @ (0xF55 * 8 + 6)
#define                                 RXB1RTR_bit         _BIT_ACCESS(RXB1DLC,6)
// RXB1CON<RXB1RTRR0>
extern volatile __bit                   RXB1RTRR0           __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 RXB1RTRR0_bit       _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1RTRRO>
extern volatile __bit                   RXB1RTRRO           __at(0x7A85);	// @ (0xF50 * 8 + 5)
#define                                 RXB1RTRRO_bit       _BIT_ACCESS(RXB1CON,5)
// RXB1SIDL<RXB1SID0>
extern volatile __bit                   RXB1SID0            __at(0x7A95);	// @ (0xF52 * 8 + 5)
#define                                 RXB1SID0_bit        _BIT_ACCESS(RXB1SIDL,5)
// RXB1SIDL<RXB1SID1>
extern volatile __bit                   RXB1SID1            __at(0x7A96);	// @ (0xF52 * 8 + 6)
#define                                 RXB1SID1_bit        _BIT_ACCESS(RXB1SIDL,6)
// RXB1SIDH<RXB1SID10>
extern volatile __bit                   RXB1SID10           __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 RXB1SID10_bit       _BIT_ACCESS(RXB1SIDH,7)
// RXB1SIDL<RXB1SID2>
extern volatile __bit                   RXB1SID2            __at(0x7A97);	// @ (0xF52 * 8 + 7)
#define                                 RXB1SID2_bit        _BIT_ACCESS(RXB1SIDL,7)
// RXB1SIDH<RXB1SID3>
extern volatile __bit                   RXB1SID3            __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 RXB1SID3_bit        _BIT_ACCESS(RXB1SIDH,0)
// RXB1SIDH<RXB1SID4>
extern volatile __bit                   RXB1SID4            __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 RXB1SID4_bit        _BIT_ACCESS(RXB1SIDH,1)
// RXB1SIDH<RXB1SID5>
extern volatile __bit                   RXB1SID5            __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 RXB1SID5_bit        _BIT_ACCESS(RXB1SIDH,2)
// RXB1SIDH<RXB1SID6>
extern volatile __bit                   RXB1SID6            __at(0x7A8B);	// @ (0xF51 * 8 + 3)
#define                                 RXB1SID6_bit        _BIT_ACCESS(RXB1SIDH,3)
// RXB1SIDH<RXB1SID7>
extern volatile __bit                   RXB1SID7            __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 RXB1SID7_bit        _BIT_ACCESS(RXB1SIDH,4)
// RXB1SIDH<RXB1SID8>
extern volatile __bit                   RXB1SID8            __at(0x7A8D);	// @ (0xF51 * 8 + 5)
#define                                 RXB1SID8_bit        _BIT_ACCESS(RXB1SIDH,5)
// RXB1SIDH<RXB1SID9>
extern volatile __bit                   RXB1SID9            __at(0x7A8E);	// @ (0xF51 * 8 + 6)
#define                                 RXB1SID9_bit        _BIT_ACCESS(RXB1SIDH,6)
// RXB1SIDL<RXB1SRR>
extern volatile __bit                   RXB1SRR             __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 RXB1SRR_bit         _BIT_ACCESS(RXB1SIDL,4)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// COMSTAT<RXBNOVFL>
extern volatile __bit                   RXBNOVFL            __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 RXBNOVFL_bit        _BIT_ACCESS(COMSTAT,6)
// COMSTAT<RXBP>
extern volatile __bit                   RXBP                __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 RXBP_bit            _BIT_ACCESS(COMSTAT,3)
// RXF0EIDL<RXF0EID0>
extern volatile __bit                   RXF0EID0            __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 RXF0EID0_bit        _BIT_ACCESS(RXF0EIDL,0)
// RXF0EIDL<RXF0EID1>
extern volatile __bit                   RXF0EID1            __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 RXF0EID1_bit        _BIT_ACCESS(RXF0EIDL,1)
// RXF0EIDH<RXF0EID10>
extern volatile __bit                   RXF0EID10           __at(0x7812);	// @ (0xF02 * 8 + 2)
#define                                 RXF0EID10_bit       _BIT_ACCESS(RXF0EIDH,2)
// RXF0EIDH<RXF0EID11>
extern volatile __bit                   RXF0EID11           __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 RXF0EID11_bit       _BIT_ACCESS(RXF0EIDH,3)
// RXF0EIDH<RXF0EID12>
extern volatile __bit                   RXF0EID12           __at(0x7814);	// @ (0xF02 * 8 + 4)
#define                                 RXF0EID12_bit       _BIT_ACCESS(RXF0EIDH,4)
// RXF0EIDH<RXF0EID13>
extern volatile __bit                   RXF0EID13           __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 RXF0EID13_bit       _BIT_ACCESS(RXF0EIDH,5)
// RXF0EIDH<RXF0EID14>
extern volatile __bit                   RXF0EID14           __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 RXF0EID14_bit       _BIT_ACCESS(RXF0EIDH,6)
// RXF0EIDH<RXF0EID15>
extern volatile __bit                   RXF0EID15           __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 RXF0EID15_bit       _BIT_ACCESS(RXF0EIDH,7)
// RXF0SIDL<RXF0EID16>
extern volatile __bit                   RXF0EID16           __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 RXF0EID16_bit       _BIT_ACCESS(RXF0SIDL,0)
// RXF0SIDL<RXF0EID17>
extern volatile __bit                   RXF0EID17           __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 RXF0EID17_bit       _BIT_ACCESS(RXF0SIDL,1)
// RXF0EIDL<RXF0EID2>
extern volatile __bit                   RXF0EID2            __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 RXF0EID2_bit        _BIT_ACCESS(RXF0EIDL,2)
// RXF0EIDL<RXF0EID3>
extern volatile __bit                   RXF0EID3            __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 RXF0EID3_bit        _BIT_ACCESS(RXF0EIDL,3)
// RXF0EIDL<RXF0EID4>
extern volatile __bit                   RXF0EID4            __at(0x781C);	// @ (0xF03 * 8 + 4)
#define                                 RXF0EID4_bit        _BIT_ACCESS(RXF0EIDL,4)
// RXF0EIDL<RXF0EID5>
