MikroElektronika/core_packages/PIC/XC8/def/PIC18F458/mcu.h
extern volatile __bit                   TXWARN              __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 TXWARN_bit          _BIT_ACCESS(COMSTAT,2)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// PORTA<VREFM>
extern volatile __bit                   VREFM               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 VREFM_bit           _BIT_ACCESS(PORTA,2)
// PORTA<VREFP>
extern volatile __bit                   VREFP               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 VREFP_bit           _BIT_ACCESS(PORTA,3)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// BRGCON3<WAKFIL>
extern volatile __bit                   WAKFIL              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 WAKFIL_bit          _BIT_ACCESS(BRGCON3,6)
// PIE3<WAKIE>
extern volatile __bit                   WAKIE               __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 WAKIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<WAKIF>
extern volatile __bit                   WAKIF               __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 WAKIF_bit           _BIT_ACCESS(PIR3,6)
// IPR3<WAKIP>
extern volatile __bit                   WAKIP               __at(0x7D2E);	// @ (0xFA5 * 8 + 6)
#define                                 WAKIP_bit           _BIT_ACCESS(IPR3,6)
// SSPCON1<WCOL>
extern volatile __bit                   WCOL                __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSPCON1,7)
// CANCON<WIN0>
extern volatile __bit                   WIN0                __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 WIN0_bit            _BIT_ACCESS(CANCON,1)
// CANCON<WIN1>
extern volatile __bit                   WIN1                __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 WIN1_bit            _BIT_ACCESS(CANCON,2)
// CANCON<WIN2>
extern volatile __bit                   WIN2                __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 WIN2_bit            _BIT_ACCESS(CANCON,3)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(PR2,0)
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(PR2,1)
// EECON1<WR>
extern volatile __bit _DEPRECATED       WR                  __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7D33);	// @ (0xFA6 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSPSTAT<nA>
extern volatile __bit                   nA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSPSTAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// PORTE<nCS>
extern volatile __bit                   nCS                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 nCS_bit             _BIT_ACCESS(PORTE,2)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,2)
// RCON<nIPEN>
extern volatile __bit                   nIPEN               __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 nIPEN_bit           _BIT_ACCESS(RCON,7)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCSTA<nRC8>
extern volatile __bit                   nRC8                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 nRC8_bit            _BIT_ACCESS(RCSTA,6)
// PORTE<nRD>
extern volatile __bit                   nRD                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 nRD_bit             _BIT_ACCESS(PORTE,0)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// PORTA<nSS>
extern volatile __bit                   nSS                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 nSS_bit             _BIT_ACCESS(PORTA,5)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// TXSTA<nTX8>
extern volatile __bit                   nTX8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nTX8_bit            _BIT_ACCESS(TXSTA,6)
// SSPSTAT<nW>
extern volatile __bit                   nW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nW_bit              _BIT_ACCESS(SSPSTAT,2)
// PORTE<nWR>
extern volatile __bit                   nWR                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 nWR_bit             _BIT_ACCESS(PORTE,1)
// SSPSTAT<nWRITE>
extern volatile __bit                   nWRITE              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nWRITE_bit          _BIT_ACCESS(SSPSTAT,2)

#endif // _PIC18F458_H_
